---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.FluidTemperatureSetIterator.Dispose
source: html/5a51a5dc-1bbc-84d8-ed17-2586026aadd8.htm
---
# Autodesk.Revit.DB.Plumbing.FluidTemperatureSetIterator.Dispose Method

Releases all resources used by the FluidTemperatureSetIterator

## Syntax (C#)
```csharp
public void Dispose()
```